xmlsamples/PI_MTCN/PH-SMS-AIS.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xrsi="http://www.westernunion.com/schema/xrsi">
   <soapenv:Header/>
   <soapenv:Body>
      <xrsi:send-money-store-request>
         <device>
            <id>GF</id>
            <type>RETAIL</type>
         </device>
         <channel>
            <type>H2H</type>
            <name>PETNET</name>
            <version>9500</version>
         </channel>
         <sender>
            <name name_type="D">
               <first_name>Roop</first_name>
               <last_name>Sundar</last_name>
            </name>
            <address>
               <addr_line1>AECS layout</addr_line1>
               <city>Navotas</city>
               <state>METRO MANILA</state>
               <postal_code>899934</postal_code>
               <country_code>
                  <iso_code>
                     <country_code>PH</country_code>
                     <currency_code>PHP</currency_code>
                  </iso_code>
                  <country_name>PHILIPPINES</country_name>
               </country_code>
            </address>
            <preferred_customer>
               <mywu_number>065A34115</mywu_number>
            </preferred_customer>
            <compliance_details>
               <compliance_data_buffer>0108UNI_01_S0201B03124261798404350611PHILIPPINES0708080319950821Prof Svc Practitioner0908101020101008111120252401N2011PHILIPPINES291110th Street8607Manilla3007Manilla321098765412309901X3311PHILIPPINES3411PHILIPPINES3501M4108Maniilla4406Salary2120Education/School Fee7006Family7401NC403608I601YJ6191000000000062676198M732Mid-Level/Supervisory/ManagementO606PH_1.1</compliance_data_buffer>
            </compliance_details>
            <email>roop@sbb.com</email>
            <contact_phone>7406366171</contact_phone>
            <mobile_phone>
               <phone_number>
                  <country_code>63</country_code>
                  <national_number>7406366171</national_number>
               </phone_number>
            </mobile_phone>
         </sender>
         <receiver>
            <name name_type="D">
               <first_name>Praveena</first_name>
               <last_name>Lakshmi</last_name>
            </name>
            <address>
               <country_code>
                  <iso_code>
                     <country_code>KR</country_code>
                     <currency_code>USD</currency_code>
                  </iso_code>
               </country_code>
               <address_type>I</address_type>
            </address>
            <mobile_phone>
               <phone_number/>
            </mobile_phone>
         </receiver>
         <payment_details>
            <expected_payout_location/>
            <recording_country_currency>
               <iso_code>
                  <country_code>PH</country_code>
                  <currency_code>PHP</currency_code>
               </iso_code>
            </recording_country_currency>
            <destination_country_currency>
               <iso_code>
                  <country_code>KR</country_code>
                  <currency_code>USD</currency_code>
               </iso_code>
            </destination_country_currency>
            <originating_country_currency>
               <iso_code>
                  <country_code>PH</country_code>
                  <currency_code>PHP</currency_code>
               </iso_code>
            </originating_country_currency>
            <originating_city>QUEZON CITY</originating_city>
            <originating_state>ME</originating_state>
            <transaction_type>WMN</transaction_type>
            <payment_type>Cash</payment_type>
            <exchange_rate>0.0199563</exchange_rate>
            <fix_on_send>Y</fix_on_send>
            <credit_debit_card_details>
               <authorization_code/>
            </credit_debit_card_details>
            <duplicate_detection_flag>O</duplicate_detection_flag>
         </payment_details>
         <financials>
            <taxes>
               <municipal_tax>0</municipal_tax>
               <state_tax>0</state_tax>
               <county_tax>0</county_tax>
            </taxes>
            <originators_principal_amount>100</originators_principal_amount>
            <destination_principal_amount>2</destination_principal_amount>
            <gross_total_amount>50100</gross_total_amount>
            <plus_charges_amount>0</plus_charges_amount>
            <charges>50000</charges>
            <message_charge>0</message_charge>
         </financials>
         <mtcn>0122802545</mtcn>
         <new_mtcn>2326380122802545</new_mtcn>
         <foreign_remote_system>
            <identifier>WGHHPH6470T</identifier>
            <reference_no>001</reference_no>
            <counter_id>PH647TT0002</counter_id>
         </foreign_remote_system>
      </xrsi:send-money-store-request>
   </soapenv:Body>
</soapenv:Envelope>